import { CommentEntity } from 'entities/comment';

export const commentsMockData: CommentEntity[] = [
    {
        id: '1',
        text: 'Не бойтесь последнего уровня сложности',
        profile: {
            id: '222',
            username: 'test_username',
            avatar_src:
                'https://sun1-19.userapi.com/s/v1/ig1/wAi6_goWcyHvdU4cO14CbMXKDV5T2CdHEdglqHFIkh_orVLklUYp6m-btlNCbCC-TUQHsM9j.jpg?quality=96&crop=229,194,1036,1036&as=32x32,48x48,72x72,108x108,160x160,240x240,360x360,480x480,540x540,640x640,720x720&ava=1&cs=50x50'
        }
    },
    {
        id: '2',
        text: 'Думаю, это главное, что можно посоветовать перед прохождением этой игры. Так много недовольных людей, сравнивающих вторую часть фростпанка с первой. Всем им нравился первый фростпанк тем, что он держит игрока в напряжении всю игру, дает ощутить реально борьбу за выживание в апокалиптичном мире и всего этого им не хватает во Frostpunk 2. А ведь все это есть, кроме разве что баланса. В первой части он все таки гениальный. Задуманный игровой опыт зашит в нормальную игру, дает необходимый челенж и не перегружает тех, кто не сильно любит испытания. Во второй части все будто бы подгонялось под максимальную сложность, видимо, хотели угодить массовому потребителю. Ну вы знаете как это бывает с сиквелами. И ведь это буквально вся претензия. Люди хотят получить этот опыт последнего города на земле, последнего очага цивилизации, где ради выживания приходится идти на жертвы человечности, они выбирают "нормальный" уровень сложности (по опыту первой части), получают легкий градострой где цена ошибки нулевая и все, погнали критиковать. Согласен, критикуют справедливо, но я познал "истинный" игровой опыт и хочу им поделиться =)',
        profile: {
            id: '222',
            username: 'test_username',
            avatar_src:
                'https://sun1-19.userapi.com/s/v1/ig1/wAi6_goWcyHvdU4cO14CbMXKDV5T2CdHEdglqHFIkh_orVLklUYp6m-btlNCbCC-TUQHsM9j.jpg?quality=96&crop=229,194,1036,1036&as=32x32,48x48,72x72,108x108,160x160,240x240,360x360,480x480,540x540,640x640,720x720&ava=1&cs=50x50'
        }
    },
    {
        id: '3',
        text: 'В описании последней сложности говорится о том, что ошибки не прощаются и это правда так. Они на вас ложатся якорем на протяжении всей игры, но это не означает, что вы тут же проиграете или что-то еще. Просто просчитавшись с решением в начале игры вы можете потом ощущать их последствия и после. Пожертвовали рабочей силой? Чтож, жаль, что после апокалипсиса у вас так мало трудоспособного народу, которого едва хватает, чтобы закрыть основные потребности, придется ждать рождаемость, либо придется увести часть рабочих с добычи еды ради своих нужд, терять в темпе ведь не хочется, стартовый квест вам буквально дышит в спину. ',
        profile: {
            id: '222',
            username: 'test_username',
            avatar_src:
                'https://sun1-19.userapi.com/s/v1/ig1/wAi6_goWcyHvdU4cO14CbMXKDV5T2CdHEdglqHFIkh_orVLklUYp6m-btlNCbCC-TUQHsM9j.jpg?quality=96&crop=229,194,1036,1036&as=32x32,48x48,72x72,108x108,160x160,240x240,360x360,480x480,540x540,640x640,720x720&ava=1&cs=50x50'
        }
    },
    {
        id: '4',
        text: 'Ну а пока запасы есть, то можно на нем сосредоточиться. Но только вот когда запасы кончатся, то начнется голод, а за ним последуют болезни и смерти, а за ними последует медленная дорога к потере контроля над ситуацией и все, гейм овер. Не хотите жертвовать едой? Можете пожертвовать чем-то другим, но с этой жертвой точно придется считаться, не сейчас, так потом. Ну и на крайний случай можно пожертвовать человечностью и погнать на работу детей, правда придется убедить совет, пообещав им что-то взамен. И вы не можете распылиться на все сразу. Все нужно. Что нужнее -- решать вам) То, что не ощущается на легких уровнях сложности ощущается с лихвой на последней. Все ваше правление -- это борьба. И ради того, чтобы ваша борьба не была напрасной, приходится идти на жертвы гуманности.',
        profile: {
            id: '222',
            username: 'test_username',
            avatar_src:
                'https://sun1-19.userapi.com/s/v1/ig1/wAi6_goWcyHvdU4cO14CbMXKDV5T2CdHEdglqHFIkh_orVLklUYp6m-btlNCbCC-TUQHsM9j.jpg?quality=96&crop=229,194,1036,1036&as=32x32,48x48,72x72,108x108,160x160,240x240,360x360,480x480,540x540,640x640,720x720&ava=1&cs=50x50'
        }
    }
];
