{
    "articles": [
      {
        "id": "1",
        "title": "Frostpunk 2: что нужно знать перед прохождением и стоит ли​ покупать",
        "subtitle": "Рассказываем о плюсах и минусах новинки",
        "avatarSrc": "https://opis-cdn.tinkoffjournal.ru/mercury/in-out-frostpunk2-qa.jpg?preset=image_1280w",
        "views": "2000",
        "createdAt": "30.04.2024",
        "type": ["GAMES", "STRATEGY"],
        "blocks": [
          {
            "id": "1",
            "type": "TEXT",
            "title": "В градостроительном симуляторе Frostpunk 2 вы выживаете в морозном постапокалипсисе и принимаете тяжелые решения.",
            "paragraphs": [
                "Ранее я уже поделился советами о том, как пережить ледяной буран. Теперь подробнее расскажу о других деталях игры: где купить новинку и сколько она стоит, какие у нее системные требования, чем стратегия радует и чем разочаровывает.",
                "Заодно перескажу события первой части и посоветую, во что еще поиграть, если вам понравилась Frostpunk 2."
            ]
          },
          {
            "id": "2",
            "type": "TEXT",
            "title": "Сколько стоит Frostpunk 2 и где ее купить",
            "paragraphs": [
              "Frostpunk 2 можно купить в российском Steam за 1900 ₽. Также стратегия доступна в EGS и GOG. О том, как покупать игры в цифровых магазинах, можно узнать в нашей инструкции. Также игра доступна по подписке Game Pass для ПК.",
              "В 2025 году стратегия выйдет на консолях PS5 и Xbox Series. Точная дата релиза неизвестна.",
              "У Frostpunk 2 есть два издания: базовое и Deluxe. В базовое издание за 1900 ₽ входит только сама игра. В Deluxe-издание за 3200 ₽ помимо игры включены: Три платных дополнения, которые выйдут позже. Постройка «Зал капитана». Повесть Warm Flesh. Цифровой артбук и саундтрек."
            ]
          },
          {
            "id": "3",
            "type": "TEXT",
            "title": "Что стоит знать о первой части перед прохождением",
            "paragraphs": [
              "Действие Frostpunk происходит в альтернативной версии 19 века. По одной из версий, несколько крупных вулканов выпустили огромное количество пепла, из-за чего солнечные лучи перестали проходить сквозь атмосферу Земли. Также есть предположение, что само Солнце начало постепенно затухать. Так или иначе, всю планету окутывает вечная зима.",
              "Британская империя начала разработку паровых генераторов. С их помощью власти хотели пережить глобальное похолодание, но климат изменился слишком быстро. Большая часть людей на Земле погибла.",
              "Выжившие отправляются в Арктику, где находится крупный паровой генератор. Там они основывают город Нью-Лондон и пытаются пережить надвигающуюся ледяную бурю.",
              "Холод заставляет разрабатывать новые технологии. Жители Нью-Лондона охотятся с помощью ловушек и выращивают овощи в защищенных теплицах. А на фабриках и угольных шахтах работают автоматоны — паровые роботы."
            ]
          },
          {
            "id": "4",
            "type": "IMAGE",
            "src": "https://opis-cdn.tinkoffjournal.ru/mercury/01-frostpunk2-qa.jpg?preset=image_1280w",
            "title": "В первые дни население Нью-Лондона составляет около полусотни человек"
          },
          {
            "id": "5",
            "type": "TEXT",
            "title": "",
            "paragraphs": [
              "В суровых условиях люди встают на путь веры или закона. В роли командующего игрок должен выбрать, каким способом остановить недовольство жителей и пережить буран.",
              "Командующий может установить диктатуру и жестко подавлять волнения среди населения с помощью дружин и тюрем. Либо заставить горожан принять новую веру и изгонять тех, кто выступает против.",
              "Нью-Лондон добивается успеха. Несмотря на все трудности, тем или иным образом городу удается пережить 150-градусный мороз. Нью-Лондон становится оплотом человечества в ледяном постапокалипсисе.",
              "События Frostpunk 2 разворачиваются 30 лет спустя. Город значительно расширился за это время, но сейчас он страдает от нехватки угля и жилья. Предыдущий смотритель умирает. Игрок берет бразды правления в свои руки и спасает город от нового ледяного шторма."
            ]
          },
          {
            "id": "6",
            "type": "IMAGE",
            "src": "https://opis-cdn.tinkoffjournal.ru/mercury/02-frostpunk2-qa.jpg?preset=image_1280w",
            "title": "Кроме основной кампании в первой Frostpunk есть дополнительные сценарии. Например, «Последняя осень» рассказывает о создании самого первого парового генератора — еще до начала глобального похолодания"
          },
          {
            "id": "7",
            "type": "TEXT",
            "title": "Особенности геймплея",
            "paragraphs": [
              "Основа игрового процесса в Frostpunk 2 почти такая же, как в первой части. Вы возводите строения и распределяете рабочих, изучаете новые технологии, обеспечиваете людей жильем, едой и теплом.",
              "Главное отличие от оригинала — возросший масштаб. Теперь нужно строить не отдельные здания, а целые районы. Население города исчисляется не сотнями, а тысячами людей. Есть и несколько других важных изменений.",
              "Карта разделена на клетки. У районов, которые можно построить, разный размер. Основные — например, продовольственный или добывающий — занимают шесть клеток, районы с хранилищами для ресурсов — только три, а особые постройки вроде дозорных башен — и вовсе одну."
            ]
          },
          {
            "id": "8",
            "type": "IMAGE",
            "src": "https://opis-cdn.tinkoffjournal.ru/mercury/03-frostpunk2-qa.jpg?preset=image_1280w",
            "title": "Вы можете самостоятельно выбрать, какие клетки будет занимать район"
          },
          {
            "id": "9",
            "type": "TEXT",
            "title": "",
            "paragraphs": [
              "Перед застройкой нужно очистить местность от снега. Для этого вы должны снарядить группу ледорубов и выбрать восемь заснеженных клеток. Чем дальше прорубаете лед, тем больше будет места для застройки и залежей ресурсов, доступных для добычи.",
              "В игре появились политические партии. Если в первой части игрок самостоятельно вводил законы, то в Frostpunk 2 все решения касательно развития города принимаются в совете. В него входит несколько групп людей с разными убеждениями.",
              "Есть два вида партий: сообщества и фракции. Первые имеют позицию только по одному из вопросов — например, как развивать экономику или науку. У вторых есть четкая идеология, которая влияет на взгляды на жизнь в городе в целом. Со временем сообщества могут объединяться и образовывать новые фракции, которые станут частью совета."
            ]
          },
          {
            "id": "10",
            "type": "CODE",
            "code": "$ git reset @~\n$ git reflog\nc4f708b HEAD@{0}: reset: moving to @~\n2c52489 HEAD@{1}: commit: added some .class files\n$ git reset 2c52489\n... and you're back where you started"
          }
        ]
      }
    ],
    "users": [
      {
        "id": "1",
        "username": "admin",
        "firstname": "Рома",
        "lastname": "Белков",
        "age": "28",
        "country_id": "1",
        "city_id": "3",
        "avatarSrc": "https://sun9-75.userapi.com/impg/c855524/v855524506/1ee2f6/zyDon6vw0ik.jpg?size=1200x628&quality=96&sign=d978dc69eba445ae80b9918348446591&type=album",
        "coverSrc": "",
        "country": {
          "id": "1",
          "name": {
            "ru": "Россия",
            "en": "Russia"
          }
        },
        "city": {
          "id": "3",
          "country_id": "1",
          "name": {
            "ru": "Пенза",
            "en": "Penza"
          }
        }
      }
    ],
    "countries": [
      {
        "id": "1",
        "name": {
          "ru": "Россия",
          "en": "Russia"
        }
      },
      {
        "id": "2",
        "name": {
          "ru": "Беларусь",
          "en": "Belarus"
        }
      },
      {
        "id": "3",
        "name": {
          "ru": "Казахстан",
          "en": "Kazakhstan"
        }
      },
      {
        "id": "4",
        "name": {
          "ru": "Армения",
          "en": "Armenia"
        }
      }
    ],
    "cities": [
      {
        "id": "1",
        "country_id": "1",
        "name": {
          "ru": "Москва",
          "en": "Moscow"
        }
      },
      {
        "id": "2",
        "country_id": "1",
        "name": {
          "ru": "Санкт-Петербург",
          "en": "Saint Petersburg"
        }
      },
      {
        "id": "3",
        "country_id": "1",
        "name": {
          "ru": "Пенза",
          "en": "Penza"
        }
      },
      {
        "id": "4",
        "country_id": "2",
        "name": {
          "ru": "Минск",
          "en": "Minsk"
        }
      },
      {
        "id": "5",
        "country_id": "2",
        "name": {
          "ru": "Гродно",
          "en": "Grodno"
        }
      },
      {
        "id": "6",
        "country_id": "2",
        "name": {
          "ru": "Брест",
          "en": "Brest"
        }
      },
      {
        "id": "7",
        "country_id": "3",
        "name": {
          "ru": "Астана",
          "en": "Astana"
        }
      },
      {
        "id": "8",
        "country_id": "3",
        "name": {
          "ru": "Алматы",
          "en": "Almaty"
        }
      },
      {
        "id": "9",
        "country_id": "3",
        "name": {
          "ru": "Караганда",
          "en": "Caraganda"
        }
      },
      {
        "id": "10",
        "country_id": "4",
        "name": {
          "ru": "Ереван",
          "en": "Erevan"
        }
      },
      {
        "id": "11",
        "country_id": "4",
        "name": {
          "ru": "Севан",
          "en": "Sevan"
        }
      },
      {
        "id": "12",
        "country_id": "4",
        "name": {
          "ru": "Агарак",
          "en": "Agarak"
        }
      }
    ]
  }